package ch01;

public class JavaProgramming {

	public static void main(String[] args) {
		//자바는 객체지향 프로그래밍이다.
		
		//프로그래밍이란 일련의 작업 단위들의 모임이다.
		
		/*자연어로 짜여진 코드를 컴퓨터가 인식할 수 있게 기계어로
		  변환하는 것을 컴파일이라고 한다.*/
		
		/*시간의 흐름에 따라 진행되는 프로그래밍은 절차지향 프로그래밍이라고 하고
		  현실의 여러 가지 특징이나 개체들을 구현하여 관련지어 프로그래밍 하는 것을
		  객체지향 프로그래밍이라 한다.*/
		
		/*자바로 작성된 자연어 파일은 Java 파일이고 그것을 토대로 JVM이 컴파일 한
		 *파일이 Class 파일이다*/
		
		/*JDK : 자바를 통합적으로 개발하기 위한 라이브러리*/
		/*JVM : 자바로 쓰여진 Java파일을 컴파일 하는 가상 머신*/
		/*JRE : JVM이 구동되기 위한 가상의 실행 환경 JRE 안에 JVM이 포함*/
	}

}
